"use client";

import AboutSection from "@/components/ui/about-section";
import { motion } from "framer-motion";

export const barbershopMockSectionsUA = [
  {
    id: 1,
    title: "Хто ми такі",
    text: "Ми — сучасний барбершоп, створений для чоловіків, які цінують якість, стиль і комфорт. У нашому просторі поєднується класична культура барберингу з сучасними трендами. Ми не просто стрижемо — ми допомагаємо кожному клієнту підкреслити свою індивідуальність, створюючи впевнений і доглянутий образ. Наша команда — це ентузіасти своєї справи, які люблять те, що роблять, і завжди працюють з душею."
  },
  {
    id: 2,
    title: "Чому саме ми",
    text: "У нашому барбершопі ти отримаєш більше, ніж просто стрижку чи гоління. Ми створюємо атмосферу, де можна розслабитись, відчути себе на своєму місці та отримати сервіс найвищого рівня. Наш підхід — це індивідуальність у всьому: від вибору стилю до порад з догляду. Ми дбаємо про кожну деталь, щоб твій візит був не просто послугою, а задоволенням. Якісні інструменти, перевірені засоби, комфорт і доброзичлива атмосфера — ось те, що робить нас особливими."
  },
  {
    id: 3,
    title: "Наші майстри",
    text: "Наша команда — це досвідчені барбери, які мають роки практики та постійно вдосконалюють свої навички. Кожен з них проходить регулярні курси підвищення кваліфікації, відвідує семінари та слідкує за світовими трендами у чоловічому стилі. Вони не просто виконують свою роботу — вони вкладають у неї креатив, знання та бажання зробити клієнта щасливим. З нами ти завжди можеш бути впевнений у результаті: акуратна робота, професійний підхід і щире прагнення зробити тебе кращим."
  }
];

const InfoSection = () => {
  return (
    <div className="w-full flex flex-col gap-6 md:gap-12">
      {barbershopMockSectionsUA.map((bs, index) => (
        <motion.div
          key={bs.id}
          initial={{ opacity: 0, y: 50 }}
          whileInView={{ opacity: 1, y: 0 }}
          viewport={{ once: true, amount: 0.03 }}
          transition={{ duration: 0.6, delay: index * 0.2 }}
        >
          <AboutSection
            imageUrl={`/images/info-section/info-section-bg-${index + 1}.jpg`}
            position={index % 2 === 0 ? "left" : "right"}
            title={bs.title}
            text={bs.text}
          />
        </motion.div>
      ))}
    </div>
  );
};

export default InfoSection;
